In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [4]:
%sql SELECT * FROM songs order by artist_id LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOLYIBD12A8C135045', 'Music is what we love', 'AR051KA1187B98B2FF', 0, Decimal('261.51')),
 ('SONSKXP12A8C13A2C9', 'Native Soul', 'AR0IAWL1187B9A96D0', 2003, Decimal('197.20')),
 ('SOGXHEG12AB018653E', 'It Makes No Difference Now', 'AR0RCMP1187FB3F427', 1992, Decimal('133.33')),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, Decimal('189.57')),
 ('SOLLHMX12AB01846DC', 'The Emperor Falls', 'AR1Y2PT1187FB5B9CE', 0, Decimal('484.62'))]

In [5]:
%sql SELECT COUNT(*) FROM songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(71,)]

In [11]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR8IEZO1187B99055E', 'Marc Shaiman', '', None, None),
 ('AR558FS1187FB45658', '40 Grit', '', None, None),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', None, None),
 ('ARNF6401187FB57032', 'Sophie B. Hawkins', 'New York, NY [Manhattan]', Decimal('40.790860'), Decimal('-73.966440')),
 ('AREVWGE1187B9B890A', 'Bitter End', 'Noci (BA)', Decimal('-13.442000'), Decimal('-41.995200'))]

In [7]:
%sql SELECT COUNT(*) FROM artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [8]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(18, 'Jacob', 'Rogers', 'M', 'free'),
 (79, 'James', 'Martin', 'M', 'free'),
 (11, 'Christian', 'Porter', 'F', 'free'),
 (77, 'Magdalene', 'Herman', 'F', 'free'),
 (24, 'Layla', 'Griffin', 'F', 'paid')]

In [9]:
%sql SELECT COUNT(*) FROM users;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(96,)]

In [12]:
%sql SELECT * FROM time ORDER BY start_time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 21, 1, 46, 796000), 21, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 21, 5, 52, 796000), 21, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 21, 8, 16, 796000), 21, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 21, 11, 13, 796000), 21, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 21, 17, 33, 796000), 21, 1, 44, 11, 2018, 3)]

In [13]:
%sql SELECT COUNT(*) FROM time;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6813,)]

In [14]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 73, 'paid', None, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (2, datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 73, 'paid', None, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (5, datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [15]:
%sql SELECT COUNT(*) FROM songplays;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [16]:
%sql select count(*) from songplays s join users u on s.user_id = u.user_id;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [17]:
%sql select * from songplays where song_id is not null limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(3225, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [18]:
%sql SELECT start_time, user_id, song_id, artist_id FROM songplays WHERE song_id IS NOT NULL;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

### test joins of songplays fact to various dimensions (time, users, songs, artists)

In [19]:
%%sql results <<
SELECT s.songplay_id, s.start_time, s.user_id, s.level, t.year, u.level, u.gender
  FROM songplays s JOIN time t ON s.start_time = t.start_time JOIN users u on s.user_id = u.user_id

 * postgresql://student:***@127.0.0.1/sparkifydb
6820 rows affected.
Returning data to local variable results

In [20]:
#print(results)

In [21]:
%%sql results <<
SELECT s.song_id, s.title, a.artist_id, a.name, u.user_id, u.last_name, u.first_name, t.year, t.month, t.day, p.session_id, p.level
  FROM songplays p 
  JOIN time t on p.start_time = t.start_time 
  JOIN users u on p.user_id=u.user_id
  JOIN songs s on p.song_id=s.song_id
  JOIN artists a on p.artist_id=a.artist_id

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable results

In [22]:
print(results)

+--------------------+----------------+--------------------+-------+---------+-----------+------------+------+-------+-----+------------+-------+
|      song_id       |     title      |     artist_id      |  name | user_id | last_name | first_name | year | month | day | session_id | level |
+--------------------+----------------+--------------------+-------+---------+-----------+------------+------+-------+-----+------------+-------+
| SOZCTXZ12AB0182364 | Setanta matins | AR5KOSW1187FB35FF4 | Elena |    15   |    Koch   |    Lily    | 2018 |   11  |  21 |    818     |  paid |
+--------------------+----------------+--------------------+-------+---------+-----------+------------+------+-------+-----+------------+-------+

In [23]:
%%sql results <<
SELECT p.song_id, p.artist_id, u.user_id, u.last_name, u.first_name, t.year, t.month, t.day, p.session_id, p.level
  FROM songplays p 
  JOIN time t on p.start_time = t.start_time 
  JOIN users u on p.user_id=u.user_id

 * postgresql://student:***@127.0.0.1/sparkifydb
6820 rows affected.
Returning data to local variable results

In [24]:
# random experimentation

In [21]:
import datetime
timestamp = datetime.datetime.fromtimestamp(1541108520)
print(timestamp.strftime('%Y-%m-%d %H:%M:%S'))
print(timestamp.strftime('%Y%m%d.%H%M%S'))

timestamp = datetime.datetime.fromtimestamp(1541108520796/1000)
print(timestamp.strftime('%Y-%m-%d %H:%M:%S'))
print(timestamp.strftime('%Y%m%d.%H%M%S'))

2018-11-01 21:42:00
20181101.214200
2018-11-01 21:42:00
20181101.214200

In [22]:
# when using magic %%sql it seems like you can't have any other code in the cell either before or after?
# this doesn't seem to be the case with %sql (single line)

In [23]:
%%sql
create or replace view timex as
select t.*, 
       case month 
          when 1 then 'January' when 2 then 'February' when 3 then 'March' 
          when 4 then 'April' when 5 then 'May' when 6 then 'June' 
          when 7 then 'July' when 8 then 'August' when 9 then 'September' 
          when 10 then 'October' when 11 then 'November' when 12 then 'December' 
          else 'other' 
       end as monthName, 
       case weekday 
          when 1 then 'Monday' when 2 then 'Tuesday' when 3 then 'Wednesday' when 4 then 'Thursday'  
          when 5 then 'Friday' when 6 then 'Saturday' when 7 then 'Sunday' else 'error' 
       end as weekdayName 
  from time t;

 * postgresql://student:***@127.0.0.1/sparkifydb
Done.

[]

In [24]:
%sql result << select * from timex limit 5;

print(result)

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
Returning data to local variable result
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+
|         start_time         | hour | day | week | month | year | weekday | monthname | weekdayname |
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+
| 2018-11-29 00:00:57.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:01:30.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:04:01.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:04:55.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:07:13.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+

In [25]:
%%sql result << 
select * 
  from timex limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
Returning data to local variable result

In [26]:
print(result)

+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+
|         start_time         | hour | day | week | month | year | weekday | monthname | weekdayname |
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+
| 2018-11-29 00:00:57.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:01:30.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:04:01.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:04:55.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:07:13.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+

In [27]:
print(result)

+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+
|         start_time         | hour | day | week | month | year | weekday | monthname | weekdayname |
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+
| 2018-11-29 00:00:57.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:01:30.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:04:01.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:04:55.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
| 2018-11-29 00:07:13.796000 |  0   |  29 |  48  |   11  | 2018 |    3    |  November |  Wednesday  |
+----------------------------+------+-----+------+-------+------+---------+-----------+-------------+

In [28]:
#########################

In [16]:
%%sql result <<    
SELECT s.song_id, a.artist_id, s.title, SUBSTR(a.name, 1, 40) as name, s.duration
  FROM songs s inner join artists a ON s.artist_id = a.artist_id
 ORDER BY a.name

 * postgresql://student:***@127.0.0.1/sparkifydb
71 rows affected.
Returning data to local variable result

In [17]:
print(result)

+--------------------+--------------------+------------------------------------------------------+------------------------------------------+-----------+
|      song_id       |     artist_id      |                        title                         |                   name                   |  duration |
+--------------------+--------------------+------------------------------------------------------+------------------------------------------+-----------+
| SOGDBUF12A8C140FAA | AR558FS1187FB45658 |                        Intro                         |                 40 Grit                  |  75.67628 |
| SONHOTT12A8C13493C | AR7G5I41187FB4CE6C |                   Something Girls                    |                 Adam Ant                 | 233.40363 |
| SOBEBDG12A58A76D60 | ARI3BMM1187FB4255E |                     Kassie Jones                     |               Alice Stuart               | 220.78649 |
| SOMUYGI12AB0188633 | ARL7K851187B99ACD2 |                       La Culpa                       |                Andy Andy                 | 226.35057 |
| SOPVXLX12A8C1402D5 | AR3JMC51187B9AE49D |                   Larger Than Life                   |             Backstreet Boys              | 236.25098 |
| SOGXHEG12AB018653E | AR0RCMP1187FB3F427 |              It Makes No Difference Now              |             Billie Jo Spears             | 133.32853 |
| SOFCHDR12AB01866EF | AREVWGE1187B9B890A |                     Living Hell                      |                Bitter End                | 282.43546 |
| SOTCKKY12AB018A141 | ARGSAFR1269FB35070 |             Sonnerie lalaleulé hi houuu              |                Blingtones                |  29.54404 |
| SOHUOAP12A8AE488E9 | ARD842G1187B997376 |                       Floating                       |                Blue Rodeo                | 491.12771 |
| SORAMLE12AB017C8B0 | ARHHO3O1187B989413 |                    Auguri Cha Cha                    |                Bob Azzam                 | 191.84281 |
| SOBKWDJ12A8C13B2F3 | AR36F9J1187FB406F1 |            Wild Rose (Back 2 Basics Mix)             |              Bombay Rockers              | 230.71302 |
| SOMZWCG12A8C13C480 | ARD7TVE1187B99BFB1 |                   I Didn't Mean To                   |                  Casual                  | 218.93179 |
| SOQLGFP12A58A7800E | ARD7TVE1187B99BFB1 |                       OAKtown                        |                  Casual                  | 259.44771 |
| SOGVQGJ12AB017F169 | AR62SOJ1187FB47BB5 |                      Ten Tonne                       |              Chase & Status              | 337.68444 |
| SOSLAVG12A8C13397F | AROGWRA122988FEE45 |                     Den Pai Alo                      |             Christos Dantis              | 243.82649 |
| SOZQDIU12A58A7BCF6 | ARNTLGG11E2835DDB9 |                  Superconfidential                   |                   Clp                    | 338.31138 |
| SOUDSGM12AC9618304 | ARNTLGG11E2835DDB9 |          Insatiable (Instrumental Version)           |                   Clp                    | 266.39628 |
| SONSKXP12A8C13A2C9 | AR0IAWL1187B9A96D0 |                     Native Soul                      |               Danilo Perez               | 197.19791 |
| SOTTDKS12AB018D69B | ARMBR4Y1187B9990EB |                 It Wont Be Christmas                 |               David Martin               | 241.47546 |
| SOBBXLX12A58A79DDA | AREDBBQ1187B98AFF5 |            Erica (2005 Digital Remaster)             |              Eddie Calvert               | 138.63138 |
| SOZCTXZ12AB0182364 | AR5KOSW1187FB35FF4 |                    Setanta matins                    |                  Elena                   | 269.58322 |
| SOILPQQ12AB017E82A | AR1ZHYZ1187FB3C717 |                 Sohna Nee Sohna Data                 |              Faiz Ali Faiz               | 599.24853 |
| SOVYKGO12AB0187199 | ARH4Z031187B9A71F2 |                 Crazy Mixed Up World                 |                Faye Adams                | 156.39465 |
| SOPSWQW12A6D4F8781 | ARGIWFO1187B9B55B7 |                Made Like This (Live)                 |              Five Bolt Main              | 225.09669 |
| SOTUKVB12AB0181477 | AR7ZKHQ1187B98DD73 |                  Blessed Assurance                   |                   Glad                   |  270.602  |
| SOQOTLQ12AB01868D0 | ARGCY1Y1187B9A4FA5 |                  Clementina Santafè                  |                 Gloriana                 | 153.33832 |
| SOFSOCN12A8C143F5D | ARXR32B1187FB57099 |                    Face the Ashes                    |                   Gob                    | 209.60608 |
| SORRZGD12A6310DBC3 | ARVBRGZ1187FB4675A |                    Harajuku Girls                    |               Gwen Stefani               | 290.55955 |
| SOYMRWW12A6D4FAB14 | ARKFYS91187B98E58F |     The Moon And I (Ordinary Day Album Version)      |          Jeff And Sheri Easter           |  267.7024 |
| SOQHXMF12AB0182363 | ARGSJW91187B9B1D6B |                   Young Boy Blues                    |               JennyAnyKind               | 218.77506 |
| SOWTBJW12AC468AC6E | ARQGYP71187FB44566 |              Broken-Down Merry-Go-Round              |               Jimmy Wakely               | 151.84934 |
| SOFNOQK12AB01840FC | ARNNKDK1187B98BBD5 |             Kutt Free (DJ Volume Remix)              |                   Jinx                   | 407.37914 |
| SOMVWWT12A58A7AE05 | ARQ9BO41187FB5CF1F |               Knocked Out Of The Park                |                John Davis                | 183.17016 |
| SOLLHMX12AB01846DC | AR1Y2PT1187FB5B9CE |                  The Emperor Falls                   |               John Wesley                | 484.62322 |
| SOZHPGD12A8C1394FE | AR9AWNF1187B9AB0B4 |                   Baby Come To Me                    |       Kenny G featuring Daryl Hall       | 236.93016 |
| SODREIN12A58A7F2E5 | ARLTWXK1187FB5A3F8 |    A Whiter Shade Of Pale (Live @ Fillmore West)     |               King Curtis                | 326.00771 |
| SOUPIRU12A6D4FA1E1 | ARJIE2Y1187B994AB7 |                 Der Kleine Dompfaff                  |               Line Renaud                | 152.92036 |
| SOBONFF12A6D4F84D8 | ARIK43K1187B9AE54C |               Tonight Will Be Alright                |              Lionel Richie               |  307.3824 |
| SOBCOSW12A8C13D398 | AR7SMBG1187B9B9066 |                  Rumba De Barcelona                  |               Los Manolos                | 218.38322 |
| SOSWKAV12AB018FC91 | ARULZCI1241B9C8611 |                    Midnight Star                     |            Luna Orbit Project            | 335.51628 |
| SOWQTQZ12A58A7B63E | ARPFHN61187FB575F6 |       Streets On Fire (Explicit Album Version)       |               Lupe Fiasco                | 279.97995 |
| SOINLJW12A8C13314C | AR8IEZO1187B99055E |                    City Slickers                     |               Marc Shaiman               | 149.86404 |
| SOOLYAZ12A6701F4A6 | AREBBGV1187FB523D2 |           Laws Patrolling (Album Version)            | Mike Jones (Featuring CJ_ Mello & Lil' B | 173.66159 |
| SOXILUQ12A58A7C72A | ARP6N5A1187B99D1A3 |                  Jenny Take a Ride                   |               Mitch Ryder                | 207.43791 |
| SOBAYLL12A8C138AF9 | ARDR4AC1187FB371A1 |           Sono andati? Fingevo di dormire            | Montserrat Caballé;Placido Domingo;Vicen | 511.16363 |
| SODUJBS12A8C132150 | ARI2JSK1187FB496EF |                 Wessex Loses a Bride                 |         Nick Ingman;Gavyn Wright         | 111.62077 |
| SOIAZJW12AB01853F1 | AR8ZCNI1187B9A069B |                      Pink World                      |             Planet P Project             | 269.81832 |
| SOLEYHO12AB0188A85 | ARAGB2O1187FB3A161 |                  Got My Mojo Workin                  |     Pucho & His Latin Soul Brothers      | 338.23302 |
| SOMJBYD12A6D4F8557 | ARD0S291187B9B7BF5 |                Keepin It Real (Skit)                 |                 Rated R                  | 114.78159 |
| SOUQQEA12A8C134B1B | ARIG6O41187B988BDD |                      High Tide                       |             Richard Souther              |  228.5971 |
| SOBLGCN12AB0183212 | AR47JEX1187B995D81 |            James (Hold The Ladder Steady)            |               SUE THOMPSON               | 124.86485 |
| SOGOSOV12AF72A285E | ARGUVEV1187B98BA17 |                  ¿Dónde va Chichi?                   |              Sierra Maestra              | 313.12934 |
| SOXVLOJ12AB0189215 | ARKRRTF1187B9984DA |                   Amor De Cabaret                    |             Sonora Santanera             | 177.47546 |
| SONWXQJ12A8C134D94 | ARNF6401187FB57032 |            The Ballad Of Sleeping Beauty             |            Sophie B. Hawkins             |  305.162  |
| SOPEGZN12AB0181B3D | AREDL271187FB40F44 |           Get Your Head Stuck On Your Neck           |               Soul Mekanik               |  45.66159 |
| SOOJPRH12A8C141995 | ARBGXIG122988F409D |                  Loaded Like A Gun                   |                Steel Rain                | 173.19138 |
| SODAUVL12A8C13D184 | ARWB3G61187FB49404 |                      Prognosis                       |               Steve Morse                | 363.85914 |
| SOGNCJP12A58A80271 | ARB29H41187B98F0EF |             Do You Finally Need A Friend             |              Terry Callier               | 342.56934 |
| SOXLBJT12A8C140925 | ARYKCQI1187FB3B18F |                  Caught In A Dream                   |                  Tesla                   | 290.29832 |
| SOCIWDW12A8C13D406 | ARMJAGH1187FB546F3 |                      Soul Deep                       |               The Box Tops               | 148.03546 |
| SOBBUGU12A8C13E95D | ARMAC4T1187FB3FA4C |           Setting Fire to Sleeping Giants            |        The Dillinger Escape Plan         | 207.77751 |
| SOYTPEP12AB0180E7B | ARAJPHH1187FB5566A |                   Twist and Shout                    |             The Shangri-Las              | 164.80608 |
| SONYPOM12A8C13B2D7 | ARDNS031187B9924F0 | I Think My Wife Is Running Around On Me (Taco Hell)  |                Tim Wilson                | 186.48771 |
| SOAOIBZ12AB01815BE | ARPBNLO1187FB3D52F | I Hold Your Hand In Mine [Live At Royal Albert Hall] |                 Tiny Tim                 |  43.36281 |
| SOFFKZS12AB017F194 | ARBEBBY1187B9B43DB |            A Higher Place (Album Version)            |                Tom Petty                 | 236.17261 |
| SOQVMXR12A81C21483 | ARKULSX1187FB45F84 |                     Salt In NYC                      |                  Trafik                  | 424.12363 |
| SOHKNRJ12A6701D1F8 | AR10USD1187B99F3F1 |                     Drop of Rain                     |          Tweeterfriendly Music           | 189.57016 |
| SOKEJEJ12A8C13E0D0 | ARC43071187B990240 |               The Urgency (LP Version)               |               Wayne Watson               | 245.21098 |
| SOLYIBD12A8C135045 | AR051KA1187B98B2FF |                Music is what we love                 |                  Wilks                   | 261.51138 |
| SOBZBAZ12A6D4F8742 | AROUOZZ1187B9ABE51 |                    Spanish Grease                    |               Willie Bobo                | 168.25424 |
| SOZVMJI12AB01808AF | ARNPAGP1241B9C7FD4 |                   Synthetic Dream                    |                lextrical                 | 165.69424 |
+--------------------+--------------------+------------------------------------------------------+------------------------------------------+-----------+

In [18]:
%%sql result <<    
SELECT s.song_id, a.artist_id, s.title, a.name, s.duration
  FROM songs s inner join artists a ON s.artist_id = a.artist_id
 WHERE s.title = 'Eye Of The Tiger'
   AND a.name = 'Survivor'
   AND s.duration = 245.36771

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
Returning data to local variable result

In [19]:
print(result)

+---------+-----------+-------+------+----------+
| song_id | artist_id | title | name | duration |
+---------+-----------+-------+------+----------+
+---------+-----------+-------+------+----------+

In [20]:
%%sql result <<    
SELECT s.song_id, a.artist_id, s.title, a.name, s.duration
  FROM songs s inner join artists a ON s.artist_id = a.artist_id
 WHERE s.title = 'Young Boy Blues'
   AND a.name = 'JennyAnyKind'
   AND s.duration = 218.77506

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable result

In [12]:
print(result)

+--------------------+--------------------+-----------------+--------------+-----------+
|      song_id       |     artist_id      |      title      |     name     |  duration |
+--------------------+--------------------+-----------------+--------------+-----------+
| SOQHXMF12AB0182363 | ARGSJW91187B9B1D6B | Young Boy Blues | JennyAnyKind | 218.77506 |
+--------------------+--------------------+-----------------+--------------+-----------+

In [9]:
%sql select count(*) from artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [10]:
%sql select count(*) from songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(71,)]

In [11]:
%sql select count(distinct(artist_id)) from songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [18]:
%%sql result <<    
SELECT s.song_id, a.artist_id, s.title, a.name, s.duration
  FROM songs s inner join artists a ON s.artist_id = a.artist_id
 WHERE s.song_id = 'SOZCTXZ12AB0182364'
   AND a.artist_id = 'AR5KOSW1187FB35FF4'

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
Returning data to local variable result

In [19]:
print(result)

+--------------------+--------------------+----------------+-------+----------+
|      song_id       |     artist_id      |     title      |  name | duration |
+--------------------+--------------------+----------------+-------+----------+
| SOZCTXZ12AB0182364 | AR5KOSW1187FB35FF4 | Setanta matins | Elena |  269.58  |
+--------------------+--------------------+----------------+-------+----------+

In [20]:
%sql select * from songplays where song_id in ('SOZCTXZ12AB0182364');

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [19]:
%%sql result << 
CREATE OR REPLACE VIEW artist_songs AS 
SELECT a.artist_id, a.name artist_name, s.song_id, s.title, s.duration 
 FROM artists a JOIN songs s ON a.artist_id = s.artist_id;

 * postgresql://student:***@127.0.0.1/sparkifydb
Done.
Returning data to local variable result

In [20]:
%sql SELECT * from artist_songs limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR8IEZO1187B99055E', 'Marc Shaiman', 'SOINLJW12A8C13314C', 'City Slickers', Decimal('149.86404')),
 ('AR558FS1187FB45658', '40 Grit', 'SOGDBUF12A8C140FAA', 'Intro', Decimal('75.67628')),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', 'SORRZGD12A6310DBC3', 'Harajuku Girls', Decimal('290.55955')),
 ('ARNF6401187FB57032', 'Sophie B. Hawkins', 'SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', Decimal('305.162')),
 ('AREVWGE1187B9B890A', 'Bitter End', 'SOFCHDR12AB01866EF', 'Living Hell', Decimal('282.43546'))]

In [7]:
%sql SELECT COUNT(*) from artist_songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(71,)]

In [8]:
%sql SELECT artist_name, title, duration from artist_songs limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Casual', "I Didn't Mean To", Decimal('218.93179')),
 ('JennyAnyKind', 'Young Boy Blues', Decimal('218.77506')),
 ('Sonora Santanera', 'Amor De Cabaret', Decimal('177.47546')),
 ('Jeff And Sheri Easter', 'The Moon And I (Ordinary Day Album Version)', Decimal('267.7024')),
 ('Clp', 'Insatiable (Instrumental Version)', Decimal('266.39628'))]

In [19]:
%sql SELECT COUNT(*) FROM log_work;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6981,)]

In [20]:
%sql SELECT COUNT(*) FROM log_work WHERE page='NextSong';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6981,)]

In [4]:
%sql select * from log_work limit 2;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[(1, 'Sydney Youngblood', 'Logged In', 'Jacob', 'M', 53, 'Klein', Decimal('238.07955'), 'paid', 'Tampa-St. Petersburg-Clearwater, FL', 'PUT', 'NextSong', '1540558108796.0', '954', "Ain't No Sunshine", '200', 1543449657796, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"', '73'),
 (2, 'Gang Starr', 'Logged In', 'Layla', 'F', 88, 'Griffin', Decimal('151.92771'), 'paid', 'Lake Havasu City-Kingman, AZ', 'PUT', 'NextSong', '1541057188796.0', '984', 'My Advice 2 You (Explicit)', '200', 1543449690796, '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"', '24')]

In [15]:
%sql SELECT ts, TO_TIMESTAMP(ts / 1000) FROM log_work LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
(psycopg2.ProgrammingError) relation "log_work" does not exist
LINE 1: SELECT ts, TO_TIMESTAMP(ts / 1000) FROM log_work LIMIT 5;
                                                ^
 [SQL: 'SELECT ts, TO_TIMESTAMP(ts / 1000) FROM log_work LIMIT 5;']

In [5]:
%sql select artist, song, length from log_work limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Sydney Youngblood', "Ain't No Sunshine", Decimal('238.07955')),
 ('Gang Starr', 'My Advice 2 You (Explicit)', Decimal('151.92771')),
 ('3OH!3', 'My First Kiss (Feat. Ke$ha) [Album Version]', Decimal('192.522')),
 ('RÃ\x83Â¶yksopp', 'The Girl and The Robot', Decimal('369.81506')),
 ('Kajagoogoo', 'Too Shy', Decimal('223.55546'))]

In [6]:
%sql select artist, song, length from log_work where (artist, song, length) in (select artist_name, title, duration from song_work);

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Elena', 'Setanta matins', Decimal('269.58322'))]

In [7]:
%sql select artist, song, length from log_work intersect select artist_name, title, duration from song_work;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Elena', 'Setanta matins', Decimal('269.58322'))]

In [8]:
%sql select artist_name, title, duration from song_work limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Marc Shaiman', 'City Slickers', Decimal('149.86404')),
 ('40 Grit', 'Intro', Decimal('75.67628')),
 ('Gwen Stefani', 'Harajuku Girls', Decimal('290.55955')),
 ('Sophie B. Hawkins', 'The Ballad Of Sleeping Beauty', Decimal('305.162')),
 ('Bitter End', 'Living Hell', Decimal('282.43546'))]

In [9]:
%sql select log_id, artist, song, length, lastname from log_work where artist in (select artist_name from song_work)

 * postgresql://student:***@127.0.0.1/sparkifydb
21 rows affected.

[(257, 'Lionel Richie', 'Still', Decimal('310.69995'), 'Cuevas'),
 (641, 'Jimmy Wakely', 'I Love You So Much It Hurts', Decimal('165.74649'), 'Levine'),
 (1352, 'Lionel Richie', 'Hello', Decimal('249.62567'), 'Klein'),
 (2072, 'Lupe Fiasco', 'The Coolest (Explicit Album Version)', Decimal('312.92036'), 'Griffin'),
 (2125, 'Blue Rodeo', "Hasn't Hit Me Yet", Decimal('310.9873'), 'Watkins'),
 (2128, 'Lupe Fiasco', 'Hurt Me Soul (Explicit Album Version)', Decimal('262.89587'), 'Benjamin'),
 (2158, 'Lupe Fiasco', 'American Terrorist [feat. Matthew Santos] (Explicit Album Version)', Decimal('280.52853'), 'Harrell'),
 (3225, 'Elena', 'Setanta matins', Decimal('269.58322'), 'Koch'),
 (4470, 'Lionel Richie', 'Lady', Decimal('265.89995'), 'Kirby'),
 (4988, 'Line Renaud', 'Le Soir', Decimal('176.16934'), 'Owens'),
 (5041, 'Lupe Fiasco', 'Shining Down [feat. Matthew Santos] (Amended Album Version)', Decimal('273.94567'), 'Kirby'),
 (5042, 'Tom Petty', "Runnin' Down A Dream", Decimal('263.23546'), 'Kirby'),
 (5072, 'Tom Petty', 'Square One (Album Version)', Decimal('204.82567'), 'Kirby'),
 (5389, 'Lupe Fiasco', 'Shining Down [feat. Matthew Santos] (Amended Album Version)', Decimal('273.94567'), 'Ayala'),
 (5484, 'Gwen Stefani', 'Danger Zone', Decimal('216.76363'), 'Fox'),
 (5680, 'Sophie B. Hawkins', 'Damn I Wish I Was Your Lover', Decimal('323.39546'), 'Rodriguez'),
 (5794, 'Lionel Richie', "Don't Wanna Lose You", Decimal('301.68771'), 'Levine'),
 (6175, 'Trafik', 'Dirty Word', Decimal('380.21179'), 'Lynch'),
 (6731, 'Gob', 'Ming Tran', Decimal('154.17424'), 'Cuevas'),
 (6768, 'Tom Petty', "Runnin' Down A Dream", Decimal('263.23546'), 'Barrett'),
 (6798, 'Tom Petty', "Runnin' Down A Dream", Decimal('263.23546'), 'Graves')]

In [10]:
%sql select log_id, artist, song, length, lastname from log_work where (artist, song) in (select artist_name, title from song_work)

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(3225, 'Elena', 'Setanta matins', Decimal('269.58322'), 'Koch')]

In [11]:
%sql select * from song_work where artist_name in ('Tom Petty', 'Lupe Fiasco', 'Lionel Richie')

 * postgresql://student:***@127.0.0.1/sparkifydb
4 rows affected.

[(1, 'ARPFHN61187FB575F6', '41.88415', '-87.63241', 'Chicago, IL', 'Lupe Fiasco', 'SOWQTQZ12A58A7B63E', 'Streets On Fire (Explicit Album Version)', Decimal('279.97995'), 0),
 (1, 'ARBEBBY1187B9B43DB', None, None, 'Gainesville, FL', 'Tom Petty', 'SOFFKZS12AB017F194', 'A Higher Place (Album Version)', Decimal('236.17261'), 1994),
 (1, 'ARBEBBY1187B9B43DB', None, None, 'Gainesville, FL', 'Tom Petty', 'SOFFKZS12AB017F194', 'A Higher Place (Album Version)', Decimal('236.17261'), 1994),
 (1, 'ARIK43K1187B9AE54C', None, None, 'Beverly Hills, CA', 'Lionel Richie', 'SOBONFF12A6D4F84D8', 'Tonight Will Be Alright', Decimal('307.3824'), 1986)]

In [12]:
%sql select artist, song, length from log_work where (artist, song, length) in (select artist_name, title, duration from song_work);

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Elena', 'Setanta matins', Decimal('269.58322'))]

In [13]:
%sql select count(*) from (select artist, song, length from log_work where (artist, song, length) in (select artist_name, title, duration from song_work)) as foo;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(1,)]

In [16]:
%sql select count(distinct song||artist||to_char(length, '99999D99999')) from log_work;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(5324,)]

In [17]:
%sql select song, artist, to_char(length, '99999D99999') from log_work limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[("Ain't No Sunshine", 'Sydney Youngblood', '   238.07955'),
 ('My Advice 2 You (Explicit)', 'Gang Starr', '   151.92771'),
 ('My First Kiss (Feat. Ke$ha) [Album Version]', '3OH!3', '   192.52200'),
 ('The Girl and The Robot', 'RÃ\x83Â¶yksopp', '   369.81506'),
 ('Too Shy', 'Kajagoogoo', '   223.55546')]